<a href="https://colab.research.google.com/github/aonekoda/ml_one_day/blob/main/01.%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%A0%84%EC%B2%98%EB%A6%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 데이터 전처리 실습

타이타닉 데이터셋으로 데이터 전처리를 실습해 보자.
* 불필요한 컬럼의 삭제
* 결측치 처리하기
* 훈련데이터/테스트데이터 분리하기
* 데이터 스케일 조정
* 범주형 데이터 처리하기

# 타이타닉 데이터셋 설명

* Survived - 생존 여부 (0 = 사망, 1 = 생존)
* Pclass - 티켓 클래스 (1 = 1등석, 2 = 2등석, 3 = 3등석)
* Sex - 성별
* Age - 나이
* SibSp - 함께 탑승한 형제 / 배우자의 수
* Parch - 함께 탑승한 부모님 / 자녀의 수
* Ticket - 티켓 번호
* Fare - 탑승 요금
* Cabin - 선실 번호
* Embarked - 선착장 (C = Cherbourg, Q = Queenstown, S = Southampton)

### 데이터 읽어 들이기 
1. titanic.csv 파일을 데이터프레임으로 읽어 들이시오.

In [1]:
import pandas as pd

titanic = pd.read_csv('https://raw.githubusercontent.com/aonekoda/ml_one_day/main/titanic.csv')
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

# 데이터 전처리 

2. 해당 데이터프레임(titanic)에서 불필요한 컬럼을 삭제합니다.

다음의 컬럼을 삭제합니다.

* PassengerId
* Name
* Ticket
* Cabin
* Fare
* Embarked

In [ ]:
titanic = titanic.drop(['PassengerId','Name','Ticket','Cabin','Fare','Embarked'], axis = 1)

### 결측치 처리하기 
3. Age 변수의 결측치 개수를 확인하는 코드를 작성하시오. Age 변수의 결측치를 평균(mean)으로 대체하는 코드를 작성하시오.

In [ ]:
titanic['Age'].isna().sum()

177

In [ ]:
mean_age = titanic['Age'].mean()
print(mean_age)

29.69911764705882

In [ ]:
titanic['Age'] = titanic['Age'].fillna(mean_age)

### 범주형 데이터 처리하기
4. 'Sex' 컬럼을 encoding 하는 코드를 작성 하시오.

In [ ]:
from sklearn.preprocessing import LabelEncoder

# 사이킷런의 LabelEncoder를 사용하여 레이블을 인코딩합니다.
encoder = LabelEncoder()
titanic['Sex'] = encoder.fit_transform(titanic['Sex'].values)
print(encoder.classes_)

['female' 'male']

In [ ]:
titanic['Sex'].head()

0    1
1    0
2    0
3    0
4    1
Name: Sex, dtype: int64

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
dtypes: float64(1), int64(5)
memory usage: 41.9 KB

### 종속변수와 독립변수

5. 해당 titanic 데이터프레임을 data(독립변수)와 target(종속변수)으로 나누는 코드를 작성 하시오.
승객의 생존여부를 분류하기 위한 모형이므로 target은 'Survived' 컬럼입니다. 'Survived' 이외의 컬럼은 data입니다.

In [ ]:
data = titanic[['Pclass','Sex','Age','SibSp','Parch']]
target = titanic['Survived']

### 훈련데이터 테스트 데이터 분리
6. 데이터를 훈련데이터/테스트데이터로 나누는 코드를 작성하시오.

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(data, target, test_size=0.3, random_state=1, stratify=target)

### 수치형 데이터 처리하기
7. 'Age' 컬럼을 StandardScaler()로 스케일을 조정하시오.

In [ ]:
from sklearn.preprocessing import StandardScaler

stdScaler = StandardScaler()
X_train['Age'] = stdScaler.fit_transform(X_train['Age'].values.reshape(-1,1))

In [ ]:
X_train['Age'].head()

472    0.288387
597    1.543804
843    0.406082
112   -0.574713
869   -1.987057
Name: Age, dtype: float64

In [ ]:
print('Mean : ', X_train['Age'].mean(), '\tStd : ', X_train['Age'].std())

Mean :  4.934077045635477e-18 	Std :  1.000803535686101

In [ ]:
X_test['Age'] = stdScaler.transform(X_test['Age'].values.reshape(-1,1))